<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="JAVA并发编程实战," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.0.1" />






<meta name="description" content="&amp;#x8981;&amp;#x7F16;&amp;#x5199;&amp;#x7EBF;&amp;#x7A0B;&amp;#x5B89;&amp;#x5168;&amp;#x7684;&amp;#x4EE3;&amp;#x7801;&amp;#xFF0C;&amp;#x5176;&amp;#x6838;&amp;#x5FC3;&amp;#x662F;&amp;#x5728;&amp;#x4E8E;&amp;#x5BF9;&amp;#x5171;&amp;#x4EAB;&amp;#x7684;&amp;#x548C;&amp;#x53EF;&amp;#x53D8;&amp;#x7684;">
<meta property="og:type" content="article">
<meta property="og:title" content="《JAVA并发编程实战》笔记：第二章 线程安全性">
<meta property="og:url" content="http://yoursite.com/2016/09/05/java并发编程第二章/index.html">
<meta property="og:site_name" content="Wangshq's blog">
<meta property="og:description" content="&amp;#x8981;&amp;#x7F16;&amp;#x5199;&amp;#x7EBF;&amp;#x7A0B;&amp;#x5B89;&amp;#x5168;&amp;#x7684;&amp;#x4EE3;&amp;#x7801;&amp;#xFF0C;&amp;#x5176;&amp;#x6838;&amp;#x5FC3;&amp;#x662F;&amp;#x5728;&amp;#x4E8E;&amp;#x5BF9;&amp;#x5171;&amp;#x4EAB;&amp;#x7684;&amp;#x548C;&amp;#x53EF;&amp;#x53D8;&amp;#x7684;">
<meta property="og:updated_time" content="2016-09-05T10:59:00.106Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="《JAVA并发编程实战》笔记：第二章 线程安全性">
<meta name="twitter:description" content="&amp;#x8981;&amp;#x7F16;&amp;#x5199;&amp;#x7EBF;&amp;#x7A0B;&amp;#x5B89;&amp;#x5168;&amp;#x7684;&amp;#x4EE3;&amp;#x7801;&amp;#xFF0C;&amp;#x5176;&amp;#x6838;&amp;#x5FC3;&amp;#x662F;&amp;#x5728;&amp;#x4E8E;&amp;#x5BF9;&amp;#x5171;&amp;#x4EAB;&amp;#x7684;&amp;#x548C;&amp;#x53EF;&amp;#x53D8;&amp;#x7684;">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>

  <title> 《JAVA并发编程实战》笔记：第二章 线程安全性 | Wangshq's blog </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?b8d45cb4b03757ea52cbdade8474a316";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>








  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">Wangshq's blog</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">Engineer change world</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      

      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                《JAVA并发编程实战》笔记：第二章 线程安全性
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-09-05T11:56:29+08:00" content="2016-09-05">
              2016-09-05
            </time>
          </span>

          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2016/09/05/java并发编程第二章/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2016/09/05/java并发编程第二章/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x8981;&#x7F16;&#x5199;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x5176;&#x6838;&#x5FC3;&#x662F;&#x5728;&#x4E8E;&#x5BF9;<strong>&#x5171;&#x4EAB;&#x7684;</strong>&#x548C;<strong>&#x53EF;&#x53D8;&#x7684;</strong>&#x72B6;&#x6001;&#x7684;&#x8BBF;&#x95EE;&#x3002;</p>
<ul>
<li>&#x5171;&#x4EAB;&#xFF1A;&#x53D8;&#x91CF;&#x53EF;&#x4EE5;&#x88AB;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x540C;&#x65F6;&#x8BBF;&#x95EE;</li>
<li>&#x53EF;&#x53D8;&#xFF1A;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x5728;&#x5176;&#x751F;&#x547D;&#x5468;&#x671F;&#x5185;&#x53EF;&#x4EE5;&#x53D1;&#x751F;&#x53D8;&#x5316;</li>
</ul>
<p>&#x5728;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x8BBF;&#x95EE;&#x6478;&#x4E2A;&#x72B6;&#x6001;&#x53D8;&#x91CF;&#xFF0C;&#x5176;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#x5199;&#x64CD;&#x4F5C;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x65F6;&#x5C31;&#x9700;&#x8981;&#x91C7;&#x53D6;&#x63AA;&#x65BD;&#x6765;&#x534F;&#x540C;&#x8FD9;&#x4E9B;&#x7EBF;&#x7A0B;&#x5BF9;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x8BBF;&#x95EE;&#x3002;Java&#x4E2D;&#x4E3B;&#x8981;&#x7684;&#x540C;&#x6B65;&#x673A;&#x5236;&#x5C31;&#x662F;&#x4F7F;&#x7528;&#x5173;&#x952E;&#x5B57;<strong>synchronized</strong>&#xFF0C;&#x5B83;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x72EC;&#x5360;&#x7684;&#x52A0;&#x9501;&#x65B9;&#x5F0F;&#x3002;&#x5176;&#x4ED6;&#x7684;&#x65B9;&#x5F0F;&#x8FD8;&#x5305;&#x62EC;&#xFF1A;volatile&#x7C7B;&#x578B;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x663E;&#x5F0F;&#x9501;&#xFF0C;&#x5DF2;&#x7ECF;&#x539F;&#x5B50;&#x53D8;&#x91CF;&#x3002;</p>
<p>&#x4E00;&#x5F00;&#x59CB;&#x8BBE;&#x8BA1;&#x4E2A;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x7C7B;&#x6BD4;&#x4EE5;&#x540E;&#x518D;&#x53BB;&#x4FEE;&#x6539;&#x8FD9;&#x4E2A;&#x7C7B;&#x4E3A;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x8981;&#x5BB9;&#x6613;&#x7684;&#x591A;&#x3002;</p>
<p>&#x5728;&#x4E00;&#x4E9B;&#x8FC7;&#x7A0B;&#x5F0F;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#x7F16;&#x5199;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x7C7B;&#x662F;&#x6BD4;&#x8F83;&#x56F0;&#x96BE;&#x548C;&#x590D;&#x6742;&#x7684;&#xFF0C;&#x4F46;&#x4F7F;&#x7528;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8FD9;&#x79CD;&#x7F16;&#x7A0B;&#x601D;&#x60F3;&#xFF08;&#x5C01;&#x88C5;&#x6027;&#xFF09;&#x4F1A;&#x5BB9;&#x6613;&#x5199;&#x51FA;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x7C7B;&#x3002;</p>
<blockquote>
<p>ps&#xFF1A;&#x6DF1;&#x523B;&#x7406;&#x89E3;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x7F16;&#x7A0B;&#x601D;&#x60F3;&#xFF0C;&#x5199;&#x51FA;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x7A0B;&#x5E8F;&#x662F;&#x5F88;&#x6709;&#x5FC5;&#x8981;&#x7684;<br><a id="more"></a><br>&#x4F46;&#x6709;&#x4E9B;&#x65F6;&#x5019;&#x4E1A;&#x52A1;&#x9700;&#x6C42;&#x4F1A;&#x4F7F;&#x5F97;&#x4F60;&#x727A;&#x7272;&#x4E00;&#x4E9B;&#x826F;&#x597D;&#x7684;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#xFF0C;&#x4EE5;&#x6362;&#x53D6;&#x6027;&#x80FD;&#x548C;&#x5411;&#x540E;&#x517C;&#x5BB9;&#xFF0C;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x4E2D;&#x7684;&#x62BD;&#x8C61;&#x548C;&#x5C01;&#x88C5;&#x4F1A;&#x964D;&#x4F4E;&#x7A0B;&#x5E8F;&#x7684;&#x6027;&#x80FD;&#xFF08;&#x8FD9;&#x91CC;&#x4E0D;&#x662F;&#x5F88;&#x7406;&#x89E3;&#xFF1F;&#xFF1F;&#xFF1F;&#xFF09;&#x3002;&#x5728;&#x7F16;&#x5199;&#x5E76;&#x53D1;&#x7A0B;&#x5E8F;&#x7684;&#x65F6;&#x5019;&#x7684;&#x4E00;&#x79CD;&#x6B63;&#x786E;&#x7684;&#x505A;&#x6CD5;&#x5C31;&#x662F;&#xFF1A;&#x9996;&#x5148;&#x8BA9;&#x4EE3;&#x7801;&#x6B63;&#x786E;&#x8FD0;&#x884C;&#xFF0C;&#x5728;&#x63D0;&#x9AD8;&#x4EE3;&#x7801;&#x901F;&#x5EA6;&#x3002;<br>ps:&#x5728;&#x5FC5;&#x987B;&#x8981;&#x63D0;&#x9AD8;&#x6027;&#x80FD;&#x7684;&#x65F6;&#x5019;&#x5728;&#x53BB;&#x505A;&#x4F18;&#x5316;&#x3002;</p>
</blockquote>
<h3 id="&#x4EC0;&#x4E48;&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;"><a href="#&#x4EC0;&#x4E48;&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;" class="headerlink" title="&#x4EC0;&#x4E48;&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;"></a>&#x4EC0;&#x4E48;&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;</h3><p>&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#xFF08;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x6027;&#xFF09;&#x7684;&#x5B9A;&#x4E49;&#xFF1A;&#x5F53;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x8BBF;&#x95EE;&#x67D0;&#x4E2A;&#x7C7B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8FD9;&#x4E2A;&#x7C7B;&#x4E2D;&#x90FD;&#x80FD;&#x8868;&#x73B0;&#x51FA;&#x6B63;&#x786E;&#x7684;&#x884C;&#x4E3A;&#x3002;</p>
<p><strong>&#x4E00;&#x4E2A;&#x65E0;&#x72B6;&#x6001;&#x7684;&#x5BF9;&#x8C61;&#x4E00;&#x5B9A;&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;</strong>&#x3002;<br>eg:Servlet&#x91CC;&#xFF1A;<br><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div></pre></td><td class="code"><pre><div class="line">public class StatelessFactorizer implements Servlet {</div><div class="line">        public void service(ServletRequest req, ServletResponse resp) {</div><div class="line">                  BigInteger i = extractFromRequest(req);</div><div class="line">                  BigInteger [] factors = factor(i);    </div><div class="line">                  encodeIntroResponse(req,factors);            </div><div class="line">        }</div><div class="line">}</div></pre></td></tr></table></figure></p>
<h3 id="&#x539F;&#x5B50;&#x6027;"><a href="#&#x539F;&#x5B50;&#x6027;" class="headerlink" title="&#x539F;&#x5B50;&#x6027;"></a>&#x539F;&#x5B50;&#x6027;</h3><p>&#x5C31;&#x662F;&#x4E0D;&#x4F1A;&#x88AB;&#x5206;&#x5272;&#x3002;<br>&#x6211;&#x4EEC;&#x5728;&#x8981;&#x5199;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x65F6;&#x5019;&#xFF0C;&#x8981;&#x53BB;&#x5224;&#x65AD;&#x8FD9;&#x4E2A;&#x64CD;&#x4F5C;&#x662F;&#x5426;&#x662F;&#x539F;&#x5B50;&#x6027;&#x7684;&#x3002;&#x4F8B;&#x5982;&#x4E00;&#x4E9B;count++&#x7684;&#x64CD;&#x4F5C;&#x3002;</p>
<ul>
<li><strong>&#x7ADE;&#x6001;&#x6761;&#x4EF6;</strong><br>&#x5728;&#x5E76;&#x53D1;&#x7F16;&#x7A0B;&#x4E2D;&#xFF0C;&#x7531;&#x4E8E;&#x4E0D;&#x6070;&#x5F53;&#x7684;&#x6267;&#x884C;&#x65F6;&#x5E8F;&#x800C;&#x51FA;&#x73B0;&#x4E0D;&#x6B63;&#x786E;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x6211;&#x4EEC;&#x628A;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x53EB;&#x505A;&#x7ADE;&#x6001;&#x6761;&#x4EF6;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x8981;&#x83B7;&#x5F97;&#x6B63;&#x5E38;&#x7684;&#x7ED3;&#x679C;&#x8981;&#x53D6;&#x51B3;&#x4E8B;&#x4EF6;&#x6267;&#x884C;&#x7684;&#x987A;&#x5E8F;&#x3002;</li>
<li><p><strong>&#x5EF6;&#x8FDF;&#x521D;&#x59CB;&#x5316;&#x4E2D;&#x7684;&#x7ADE;&#x6001;&#x6761;&#x4EF6;</strong><br>&#x8FD9;&#x4E2A;&#x7684;&#x4F8B;&#x5B50;&#x5C31;&#x662F;&#x7C7B;&#x4F3C;&#x4E8E;&#x5355;&#x4F8B;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4E2D;&#x61D2;&#x6C49;&#x5F0F;&#x5BB9;&#x6613;&#x51FA;&#x73B0;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div></pre></td><td class="code"><pre><div class="line">private Instancea a = null;</div><div class="line"></div><div class="line">public Instance getInstance(){</div><div class="line">	if(a == null){</div><div class="line">		a = new Instance();</div><div class="line">	}</div><div class="line">	return a;</div><div class="line">}</div></pre></td></tr></table></figure>
</li>
<li><p><strong>&#x590D;&#x5408;&#x64CD;&#x4F5C;</strong><br>&#x50CF; count++&#x8FD9;&#x79CD;&#x8BFB;&#x53D6;-&#x4FEE;&#x6539;-&#x5199;&#x4EBA;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x548C;&#x4E0A;&#x9762;&#x8BF4;&#x7684;&#x5EF6;&#x8FDF;&#x521D;&#x59CB;&#x5316;&#x7684;&#x64CD;&#x4F5C;&#x5176;&#x5B9E;&#x90FD;&#x662F;&#x591A;&#x4E2A;&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#x7EC4;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x8981;&#x4FDD;&#x8BC1;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x8BDD;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x5C06;&#x8FD9;&#x5199;&#x64CD;&#x4F5C;&#x4E5F;&#x4EE5;&#x539F;&#x5B50;&#x6027;&#x6765;&#x6267;&#x884C;&#x3002;&#x8FD9;&#x4E00;&#x6837;&#x7684;&#x64CD;&#x4F5C;&#x53EB;&#x505A;&#x590D;&#x5408;&#x64CD;&#x4F5C;&#x3002;&#xFF08;&#x901A;&#x8FC7;&#x52A0;&#x9501;&#x673A;&#x5236;&#x53EF;&#x4EE5;&#x5F88;&#x597D;&#x7684;&#x4FDD;&#x8BC1;&#x7EBF;&#x7A0B;&#x7684;&#x5B89;&#x5168;&#x6027;&#xFF09;</p>
</li>
</ul>
<h3 id="&#x52A0;&#x9501;&#x673A;&#x5236;"><a href="#&#x52A0;&#x9501;&#x673A;&#x5236;" class="headerlink" title="&#x52A0;&#x9501;&#x673A;&#x5236;"></a>&#x52A0;&#x9501;&#x673A;&#x5236;</h3><p>&#x5728;Servlet&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x5BF9;&#x8C61;&#x6765;&#x8868;&#x793A;Servlet&#x7684;&#x72B6;&#x6001;&#x3002;&#x4F46;&#x8981;&#x662F;&#x5728;&#x4E00;&#x4E2A;Servlet&#x4E2D;&#x6DFB;&#x52A0;&#x4E86;&#x5F88;&#x591A;&#x79CD;&#x72B6;&#x6001;&#xFF0C;&#x90A3;&#x4E48;&#x662F;&#x5426;&#x53EA;&#x9700;&#x8981;&#x6211;&#x4EEC;&#x628A;&#x8FD9;&#x4E9B;&#x72B6;&#x6001;&#x53D8;&#x6210;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x5C31;&#x8DB3;&#x591F;&#x4E86;&#x5417;&#xFF1F;<br>&#x7B54;&#x6848;&#x80AF;&#x5B9A;&#x662F;&#x5426;&#x5B9A;&#x7684;&#x3002;&#x5F53;&#x8FD9;&#x4E24;&#x4E2A;&#x5C5E;&#x6027;&#x4E4B;&#x95F4;&#x6709;&#x67D0;&#x79CD;&#x5173;&#x7CFB;&#xFF0C;&#x8FD9;&#x4E9B;&#x5C5E;&#x6027;&#x72B6;&#x6001;&#x4E0D;&#x662F;&#x72EC;&#x7ACB;&#x5B58;&#x5728;&#x7684;&#x3002;&#x8FD9;&#x65F6;&#x5019;&#x5C31;&#x4E0D;&#x80FD;&#x4F9D;&#x9760;&#x4F7F;&#x6BCF;&#x4E2A;&#x5C5E;&#x6027;&#x7684;&#x64CD;&#x4F5C;&#x662F;&#x539F;&#x5B50;&#x6027;&#x6765;&#x786E;&#x4FDD;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x3002;</p>
<blockquote>
<p>&#x8981;&#x4FDD;&#x6301;&#x72B6;&#x6001;&#x7684;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x5728;&#x5355;&#x4E2A;&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#x4E2D;&#x66F4;&#x65B0;&#x6240;&#x6709;&#x76F8;&#x5173;&#x7684;&#x72B6;&#x6001;&#x53D8;&#x91CF;</p>
</blockquote>
<p>&#x90A3;&#x5982;&#x4F55;&#x8BA9;&#x8FD9;&#x79CD;&#x590D;&#x6742;&#x7684;&#x64CD;&#x4F5C;&#x6765;&#x4FDD;&#x6301;&#x539F;&#x5B50;&#x6027;&#x5462;&#xFF1F;java&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x5185;&#x7F6E;&#x7684;&#x9501;&#x673A;&#x5236;&#xFF1A;</p>
<h3 id="&#x5185;&#x7F6E;&#x9501;"><a href="#&#x5185;&#x7F6E;&#x9501;" class="headerlink" title="&#x5185;&#x7F6E;&#x9501;"></a>&#x5185;&#x7F6E;&#x9501;</h3><p>synchronized&#x5173;&#x952E;&#x5B57;&#x6765;&#x5B9E;&#x73B0;&#x5185;&#x7F6E;&#x9501;&#x3002;<br><a href="http://blog.csdn.net/luoweifu/article/details/46613015" target="_blank" rel="external">&#x5173;&#x4E8E;synchronized&#x7684;&#x4F7F;&#x7528;&#xFF0C;&#x53EF;&#x4EE5;&#x70B9;&#x51FB;&#x8FD9;&#x91CC;</a><br>&#x603B;&#x7ED3;&#x4E0B;&#xFF1A;<br>synchronized&#x662F;Java&#x4E2D;&#x7684;&#x5173;&#x952E;&#x5B57;&#xFF0C;&#x662F;&#x4E00;&#x79CD;&#x540C;&#x6B65;&#x9501;&#x3002;&#x5B83;&#x4FEE;&#x9970;&#x7684;&#x5BF9;&#x8C61;&#x6709;&#x4EE5;&#x4E0B;&#x51E0;&#x79CD;&#xFF1A; </p>
<ol>
<li><strong>&#x4FEE;&#x9970;&#x4E00;&#x4E2A;&#x4EE3;&#x7801;&#x5757;</strong>&#xFF1A;&#x88AB;&#x4FEE;&#x9970;&#x7684;&#x4EE3;&#x7801;&#x5757;&#x79F0;&#x4E3A;&#x540C;&#x6B65;&#x8BED;&#x53E5;&#x5757;&#xFF0C;&#x5176;&#x4F5C;&#x7528;&#x7684;&#x8303;&#x56F4;&#x662F;&#x5927;&#x62EC;&#x53F7;{}&#x62EC;&#x8D77;&#x6765;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4F5C;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#x662F;&#x8C03;&#x7528;&#x8FD9;&#x4E2A;<strong>&#x4EE3;&#x7801;&#x5757;&#x7684;&#x5BF9;&#x8C61;</strong></li>
<li><strong>&#x4FEE;&#x9970;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;</strong>&#xFF1A;&#x88AB;&#x4FEE;&#x9970;&#x7684;&#x65B9;&#x6CD5;&#x79F0;&#x4E3A;&#x540C;&#x6B65;&#x65B9;&#x6CD5;&#xFF0C;&#x5176;&#x4F5C;&#x7528;&#x7684;&#x8303;&#x56F4;&#x662F;&#x6574;&#x4E2A;&#x65B9;&#x6CD5;&#xFF0C;&#x4F5C;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#x662F;&#x8C03;&#x7528;<strong>&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x7684;&#x5BF9;&#x8C61;</strong></li>
<li><strong>&#x4FEE;&#x9970;&#x4E00;&#x4E2A;&#x9759;&#x6001;&#x7684;&#x65B9;&#x6CD5;</strong>&#xFF1A;&#x5176;&#x4F5C;&#x7528;&#x7684;&#x8303;&#x56F4;&#x662F;&#x6574;&#x4E2A;&#x9759;&#x6001;&#x65B9;&#x6CD5;&#xFF0C;&#x4F5C;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#x662F;&#x8FD9;&#x4E2A;&#x7C7B;&#x7684;<strong>&#x6240;&#x6709;&#x5BF9;&#x8C61;</strong></li>
<li><strong>&#x4FEE;&#x9970;&#x4E00;&#x4E2A;&#x7C7B;</strong>&#xFF1A;&#x5176;&#x4F5C;&#x7528;&#x7684;&#x8303;&#x56F4;&#x662F;synchronized&#x540E;&#x9762;&#x62EC;&#x53F7;&#x62EC;&#x8D77;&#x6765;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x4F5C;&#x7528;&#x4E3B;&#x7684;&#x5BF9;&#x8C61;&#x662F;&#x8FD9;&#x4E2A;&#x7C7B;&#x7684;<strong>&#x6240;&#x6709;&#x5BF9;&#x8C61;</strong></li>
</ol>
<p>&#x4F46;&#x662F;&#x5076;&#x7528;&#x8FD9;&#x79CD;&#x9501;&#x7684;&#x65F6;&#x5019;&#x8981;&#x6CE8;&#x610F;&#x4E0D;&#x8981;&#x8FC7;&#x4E8E;&#x6781;&#x7AEF;&#xFF0C;&#x56E0;&#x4E3A;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x9501;&#x53EA;&#x5141;&#x8BB8;&#x83B7;&#x5F97;&#x9501;&#x7684;&#x7EBF;&#x7A0B;&#x6765;&#x6267;&#x884C;&#xFF0C;&#x5176;&#x4ED6;&#x83B7;&#x53D6;&#x4E0D;&#x5230;&#x7684;&#x53EA;&#x80FD;&#x7B49;&#x5F85;&#x3002;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x6548;&#x7387;&#x662F;&#x5F88;&#x4F4E;&#x7684;&#x3002;</p>
<p>&#x503C;&#x5F97;&#x4E00;&#x63D0;&#x7684;&#x662F;&#x7528;Synchronized&#x662F;&#x4E00;&#x4E2A;<strong>&#x53EF;&#x91CD;&#x5165;&#x9501;</strong>&#x3002;&#x5C31;&#x662F;&#x9501;&#x7684;&#x5BF9;&#x8C61;&#x53EF;&#x4EE5;&#x88AB;&#x91CD;&#x590D;&#x83B7;&#x53D6;&#x3002;</p>
<blockquote>
<p>&#x91CD;&#x5165;&#x9501;&#xFF1A;&#x5C31;&#x662F;&#x7EBF;&#x7A0B;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x4E00;&#x4E2A;&#x7531;&#x5B83;&#x81EA;&#x5DF1;&#x6301;&#x6709;&#x7684;&#x9501;&#x3002;&#x591A;&#x7528;&#x4E8E;&#x5B50;&#x7C7B;&#x7236;&#x7C7B;&#x3001;&#x8FED;&#x4EE3;&#x4E2D;<br>ps&#xFF1A;&#x91CD;&#x5165;&#x7684;&#x7C92;&#x5EA6;&#x662F;&#x7EBF;&#x7A0B;&#x800C;&#x4E0D;&#x662F;&#x8C03;&#x7528;</p>
</blockquote>
<h3 id="&#x7528;&#x9501;&#x6765;&#x4FDD;&#x62A4;&#x72B6;&#x6001;"><a href="#&#x7528;&#x9501;&#x6765;&#x4FDD;&#x62A4;&#x72B6;&#x6001;" class="headerlink" title="&#x7528;&#x9501;&#x6765;&#x4FDD;&#x62A4;&#x72B6;&#x6001;"></a>&#x7528;&#x9501;&#x6765;&#x4FDD;&#x62A4;&#x72B6;&#x6001;</h3><p>&#x9501;&#x53EF;&#x4EE5;&#x4F7F;&#x7684;&#x4EE3;&#x7801;&#x5F97;&#x4EE5;&#x4E32;&#x884C;&#x6267;&#x884C;&#x3002;</p>
<p>&#x8BBF;&#x95EE;&#x5171;&#x4EAB;&#x72B6;&#x6001;&#x7684;&#x590D;&#x5408;&#x64CD;&#x4F5C;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x6301;&#x6709;&#x4E00;&#x4E2A;&#x9501;&#xFF08;&#x5207;&#x8BB0;&#x5FC5;&#x987B;&#x662F;&#x76F8;&#x540C;&#x7684;&#x5BF9;&#x8C61;&#xFF09;&#xFF0C;&#x4E0D;&#x80FD;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x9501;&#x3002;&#x5E76;&#x4E14;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;&#x5171;&#x4EAB;&#x72B6;&#x6001;&#x7684;&#x6240;&#x6709;&#x4F4D;&#x7F6E;&#x90FD;&#x8981;&#x52A0;&#x8FD9;&#x4E2A;&#x9501;&#xFF0C;&#x5305;&#x62EC;&#x8BFB;&#x548C;&#x5199;&#x7684;&#x5730;&#x65B9;&#x3002;&#x4E0D;&#x80FD;&#x53EA;&#x5728;&#x5199;&#x7684;&#x5730;&#x65B9;&#x52A0;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x4E00;&#x4E9B;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x7C7B;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x8BF4;&#x4F7F;&#x7528;&#x4E86;&#x8FD9;&#x4E2A;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x7C7B;&#x4E86;&#x5C31;&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#xFF0C;&#x5B83;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x5B89;&#x5168;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x653E;&#x5230;&#x4E00;&#x8D77;&#x5C31;&#x4E0D;&#x4E00;&#x5B9A;&#x5B89;&#x5168;&#x7684;&#x4E86;&#x3002;</p>
<h3 id="&#x6D3B;&#x8DC3;&#x6027;&#x4E0E;&#x6027;&#x80FD;"><a href="#&#x6D3B;&#x8DC3;&#x6027;&#x4E0E;&#x6027;&#x80FD;" class="headerlink" title="&#x6D3B;&#x8DC3;&#x6027;&#x4E0E;&#x6027;&#x80FD;"></a>&#x6D3B;&#x8DC3;&#x6027;&#x4E0E;&#x6027;&#x80FD;</h3><p>&#x6EE5;&#x7528;Synchronized&#xFF0C;&#x4F1A;&#x4F7F;&#x5F97;&#x7C92;&#x5EA6;&#x5F88;&#x7C97;&#xFF0C;&#x4E3A;&#x7EBF;&#x7A0B;&#x7684;&#x5B89;&#x5168;&#x6027;&#x7684;&#x4EE3;&#x4EF7;&#x5C31;&#x5F88;&#x9AD8;&#x3002;&#x6211;&#x4EEC;&#x5DF2;&#x6539;&#x6E7F;&#x5EA6;&#x7684;&#x7F29;&#x5C0F;&#x540C;&#x6B65;&#x4EE3;&#x7801;&#x5757;&#x7684;&#x4F5C;&#x7528;&#x8303;&#x56F4;&#x3002;&#x5728;&#x8FD9;&#x4E24;&#x4E2A;&#x4E4B;&#x95F4;&#x8981;&#x4FDD;&#x6301;&#x4E00;&#x4E2A;&#x5EA6;&#x3002;</p>

      
    </div>

    <div>
      
        
      
    </div>

    <div>
      
        
  <div style="padding: 10px 0; margin: 20px auto; width: 90%; text-align: center;">
    <div>老板，赏两个铜板呗！\(^o^)/</div>
    <button id="rewardButton" disable="enable" onclick="var qr = document.getElementById('QR'); if (qr.style.display === 'none') {qr.style.display='block';} else {qr.style.display='none'}">
      <span>赏</span>
    </button>
    <div id="QR" style="display: none;">
      
        <div id="wechat" style="display: inline-block">
          <img id="wechat_qr" src="/images/weixin.png" alt="wangshq WeChat Pay"/>
          <p>微信打赏</p>
        </div>
      
      
        <div id="alipay" style="display: inline-block">
          <img id="alipay_qr" src="/images/zhifubao.png" alt="wangshq Alipay"/>
          <p>支付宝打赏</p>
        </div>
      
    </div>
  </div>


      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/JAVA并发编程实战/" rel="tag">#JAVA并发编程实战</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/09/02/十一行程/" rel="next" title="十一行程">
                <i class="fa fa-chevron-left"></i> 十一行程
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2016/09/05/java并发编程第二章/"
           data-title="《JAVA并发编程实战》笔记：第二章 线程安全性" data-url="http://yoursite.com/2016/09/05/java并发编程第二章/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/uploads/avatar.png"
               alt="wangshq" />
          <p class="site-author-name" itemprop="name">wangshq</p>
          <p class="site-description motion-element" itemprop="description">Love for LYH</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">6</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">4</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/wangshq" target="_blank" title="GitHub">
                  
                    <i class="fa fa-fw fa-github"></i>
                  
                  GitHub
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/2760676373/profile?rightmod=1&wvr=6&mod=personinfo" target="_blank" title="微博">
                  
                    <i class="fa fa-fw fa-globe"></i>
                  
                  微博
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://www.zhihu.com/people/wang-zhi-quan-95" target="_blank" title="知乎">
                  
                    <i class="fa fa-fw fa-globe"></i>
                  
                  知乎
                </a>
              </span>
            
          
        </div>

        
        

        
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-3"><a class="nav-link" href="#什么是线程安全的"><span class="nav-number">1.</span> <span class="nav-text">什么是线程安全的</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#原子性"><span class="nav-number">2.</span> <span class="nav-text">原子性</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#加锁机制"><span class="nav-number">3.</span> <span class="nav-text">加锁机制</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#内置锁"><span class="nav-number">4.</span> <span class="nav-text">内置锁</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#用锁来保护状态"><span class="nav-number">5.</span> <span class="nav-text">用锁来保护状态</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#活跃性与性能"><span class="nav-number">6.</span> <span class="nav-text">活跃性与性能</span></a></li></ol></div>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2016</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">wangshq</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=5.0.1"></script>



  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"wangshq"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
  





  
  
  

  

  

</body>
</html>
